vp-services/src/test/resources/testfiles/RequestTriggerVp004.xml

<!--

    Copyright (c) 2013 Center for eHalsa i samverkan (CeHis).
    							<http://cehis.se/>

    This file is part of SKLTP.

    This library is free software; you can redistribute it and/or
    modify it under the terms of the GNU Lesser General Public
    License as published by the Free Software Foundation; either
    version 2.1 of the License, or (at your option) any later version.

    This library is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
    Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public
    License along with this library; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA

-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:domain:subdomain:GetProductDetailResponder:1">
   <soapenv:Header>
      <add:To>unkown-logical-adress</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:getProductDetailElem>
         <!--Optional:-->
         <urn:productId>1</urn:productId>
      </urn:getProductDetailElem>
   </soapenv:Body>
</soapenv:Envelope>